<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Tooltip Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for various help texts.
    |
    */

    
    'product_stock_alert' => "কম মজুদযুক্ত পণ্য। <br/> <small class = 'text-muted'> অ্যাড প্রোডাক্ট স্ক্রিনে সেট করা পণ্যের সতর্কতার পরিমাণের উপর ভিত্তি করে। <br> স্টক শেষ হওয়ার আগে এই পণ্যগুলি কিনুন। </small> ",

    'payment_dues' => "কেনাকাটার জন্য মুলতুবি থাকা। <br/> <small class = 'text-muted'> সরবরাহকারীর বেতনের মেয়াদের উপর ভিত্তি করে। <br/> days দিন বা তার কম সময়ে পরিশোধ করা পেমেন্ট দেখানো হচ্ছে। </small> ",

    'input_tax' => 'নির্বাচিত সময়ের মধ্যে বিক্রয়ের জন্য সংগৃহীত মোট কর।',

    'output_tax' => 'নির্বাচিত সময়ের জন্য কেনাকাটার জন্য প্রদত্ত মোট কর।',

    'tax_overall' => 'নির্বাচিত সময়ের মধ্যে সংগৃহীত মোট কর এবং প্রদত্ত মোট করের মধ্যে পার্থক্য।',

    'buy_due' => 'ক্রয়ের জন্য মোট অবৈতনিক পরিমাণ।',

    'sell_due' => 'বিক্রয় থেকে প্রাপ্ত মোট পরিমাণ',

    'over_all_sell_purchase' => '-ve value = পরিশোধের পরিমাণ <br>+ve মান = প্রাপ্তির পরিমাণ',

    'no_of_products_for_trending_products' => 'নিচের চার্টে তুলনা করার জন্য শীর্ষ প্রবণ পণ্যের সংখ্যা।',

    'top_trending_products' => "আপনার দোকানের সর্বাধিক বিক্রিত পণ্য। <br/> <small class = 'text-muted'> নির্দিষ্ট ক্যাটাগরি, ব্র্যান্ড, ব্যবসার অবস্থান ইত্যাদি ট্রেন্ডিং পণ্য জানতে ফিল্টার প্রয়োগ করুন </small>",

    'sku' => "ইউনিক প্রোডাক্ট আইডি বা স্টক কিপিং ইউনিট <br> <br> স্বয়ংক্রিয়ভাবে স্কু জেনারেট করার জন্য এটি ফাঁকা রাখুন। <br> <small class = 'text-muted'> আপনি ব্যবসায়িক সেটিংসে স্কু উপসর্গ পরিবর্তন করতে পারেন। < </ small> ",

    'enable_stock' => "একটি পণ্যের জন্য স্টক ম্যানেজমেন্ট সক্ষম বা অক্ষম করুন। <br> <br> <small class = 'text-muted'> স্টক ম্যানেজমেন্ট বেশিরভাগ পরিষেবার জন্য নিষ্ক্রিয় করা উচিত। উদাহরণ: চুল কাটা, মেরামত করা ইত্যাদি। </small> ",

    'alert_quantity' => "পণ্যের স্টক নির্দিষ্ট পরিমাণে পৌঁছলে বা নিচে চলে গেলে সতর্ক হোন। <br> <br> <small class = 'text -muted'> কম স্টকযুক্ত পণ্য ড্যাশবোর্ডে প্রদর্শিত হবে - পণ্য স্টক সতর্কতা বিভাগে। </small> ",

    'product_type' => '<b> একক পণ্য </b>: কোন বৈচিত্র ছাড়াই পণ্য।
    <br> <b> পরিবর্তনশীল পণ্য </b>: আকার, রঙ ইত্যাদির মতো বৈচিত্র সহ পণ্য
    <br> <b> কম্বো পণ্য </b>: একাধিক পণ্যের সংমিশ্রণ, যাকে বান্ডেল পণ্যও বলা হয়',

    'profit_percent' => "পণ্যের জন্য ডিফল্ট মুনাফা মার্জিন। <br>" ,

    'pay_term' => "নির্ধারিত সময়ের মধ্যে ক্রয়/বিক্রয়ের জন্য অর্থ প্রদান করতে হবে। <br/> <small class = 'text -muted'> সমস্ত আসন্ন বা বকেয়া পেমেন্ট ড্যাশবোর্ডে প্রদর্শিত হবে - পেমেন্ট ডিউ বিভাগ </ ছোট> ",

    'order_status' => 'এই ক্রয়ের পণ্যগুলি শুধুমাত্র তখনই বিক্রয়ের জন্য পাওয়া যাবে যদি <b> অর্ডার স্ট্যাটাস </b> <b> আইটেম রিসিভ </b> হয়।',

    'buy_location' => 'ব্যবসায়ের অবস্থান যেখানে ক্রয়কৃত পণ্য বিক্রয়ের জন্য পাওয়া যাবে।',

    'sale_location' => 'যেখান থেকে আপনি বিক্রি করতে চান সেখানকার ব্যবসার অবস্থান',

    'sale_discount' => "ব্যবসায়িক সেটিংসে সমস্ত বিক্রির জন্য 'ডিফল্ট বিক্রয় ছাড়' সেট করুন। ডিসকাউন্ট যোগ/আপডেট করতে নিচের সম্পাদনা আইকনে ক্লিক করুন।",

    'sale_tax' => "ব্যবসায়িক সেটিংসে সমস্ত বিক্রির জন্য 'ডিফল্ট বিক্রয় কর' সেট করুন। অর্ডার ট্যাক্স যোগ/আপডেট করতে নিচের সম্পাদনা আইকনে ক্লিক করুন।",

    'default_profit_percent' => "একটি পণ্যের ডিফল্ট মুনাফা মার্জিন। <br> <small class = 'text-muted'> প্রবেশ করা ক্রয়ের মূল্যের উপর ভিত্তি করে বিক্রয়মূল্য গণনা করতে ব্যবহৃত হয়। যোগ করা হচ্ছে </ছোট> ",

    'fy_start_month' => 'আপনার ব্যবসার জন্য আর্থিক বছরের শুরু মাস',

    'business_tax' => 'আপনার ব্যবসার জন্য নিবন্ধিত কর নম্বর।',

    'invoice_scheme' => "ইনভয়েস স্কিম মানে ইনভয়েস নাম্বারিং ফরম্যাট। এই ব্যবসার লোকেশনের জন্য যে স্কিমটি ব্যবহার করতে হবে তা নির্বাচন করুন <br> <small class = 'text-muted'> <i> আপনি নতুন ইনভয়েস স্কিম যোগ করতে পারেন </b> চালান সেটিংস </i> </small> ",

    'invoice_layout' => "এই ব্যবসার লোকেশনের জন্য ইনভয়েস লেআউট ব্যবহার করা হবে <br> <small class = 'text-muted'> (<i> আপনি <b> ইনভয়েসে নতুন <b> ইনভয়েস লেআউট </b> যোগ করতে পারেন সেটিংস <b> </i>) </small> ",

    'invoice_scheme_name' => 'চালান প্রকল্পে একটি সংক্ষিপ্ত অর্থপূর্ণ নাম দিন।',

    'invoice_scheme_prefix' => 'একটি চালান প্রকল্পের উপসর্গ। <br> একটি উপসর্গ একটি কাস্টম পাঠ্য বা চলতি বছর হতে পারে। যেমন: #XXXX0001, #2018-0002 ',

    'invoice_scheme_start_number' => "ইনভয়েস সংখ্যার জন্য নম্বর শুরু করুন। <br> <small class = 'text-muted'> আপনি এটিকে 1 বা অন্য যে কোন সংখ্যা থেকে শুরু করতে পারেন। </ছোট>",

    'invoice_scheme_count' => 'চালান স্কিমের জন্য মোট চালানের মোট সংখ্যা',

    'invoice_scheme_total_digits' => 'চালান সংখ্যার দৈর্ঘ্য ব্যতীত চালান উপসর্গ',

    'tax_groups' => 'গ্রুপ ট্যাক্স রেট - উপরে সংজ্ঞায়িত, ক্রয়/বিক্রয় বিভাগে সমন্বয়ে ব্যবহার করা হবে।',

    'unit_allow_decimal' => "দশমিক আপনাকে ভগ্নাংশে সম্পর্কিত পণ্য বিক্রি করতে দেয়।",

    'print_label' => 'পণ্য যুক্ত করুন -> লেবেলে দেখানোর জন্য তথ্য নির্বাচন করুন -> বারকোড সেটিং নির্বাচন করুন -> প্রিভিউ লেবেল -> মুদ্রণ করুন',

    'expense_for' => 'যে ব্যবহারকারীর সাথে ব্যয় সম্পর্কিত সেটিকে বেছে নিন। <i> (ptionচ্ছিক) </i> <br/> <small> উদাহরণ: একজন কর্মচারীর বেতন। </small> ',
    
    'all_location_permission' => 'যদি <b> সব লোকেশন </b> এই ভূমিকা নির্বাচন করে তাহলে সব ব্যবসায়িক লোকেশন অ্যাক্সেস করার অনুমতি থাকবে',

    'dashboard_permission' => 'যদি অনির্বাচন করা হয় তবে শুধুমাত্র স্বাগত বার্তা বাড়িতে প্রদর্শিত হবে।',

    'access_locations_permission' => 'এই ভূমিকা অ্যাক্সেস করতে পারে এমন সমস্ত স্থান নির্বাচন করুন। নির্বাচিত অবস্থানের জন্য সমস্ত ডেটা শুধুমাত্র ব্যবহারকারীর কাছে প্রদর্শিত হবে। <br/> <br/> <small> উদাহরণস্বরূপ: আপনি এটি ব্যবহার করতে পারেন i> নির্দিষ্ট অবস্থানের। </small> ',

    'print_receipt_on_invoice' => 'চূড়ান্ত করার সময় চালানের স্বয়ংক্রিয় মুদ্রণ সক্ষম বা অক্ষম করুন',

    'receipt_printer_type' => "<i> ব্রাউজার ভিত্তিক মুদ্রণ </i>: চালান প্রিভিউ সহ ব্রাউজার প্রিন্ট ডায়ালগ বক্স দেখান <br/> <br/> <i> কনফিগার করা রসিদ প্রিন্টার ব্যবহার করুন </i>: একটি কনফিগার করা রসিদ নির্বাচন করুন/ মুদ্রণের জন্য থার্মাল প্রিন্টার",

    'adjustment_type' => '<i> নরমাল </i>: লিকেজ, ড্যামেজ ইত্যাদি স্বাভাবিক কারণের জন্য অ্যাডজাস্টমেন্ট। । ',

    'total_amount_recovered' => 'বীমা বা স্ক্র্যাপ বা অন্যদের বিক্রি থেকে উদ্ধারকৃত পরিমাণ',

    'express_checkout' => 'সম্পূর্ণ পরিশোধিত এবং চেকআউট চিহ্নিত করুন',
    'total_card_slips' => 'এই রেজিস্টারে ব্যবহৃত কার্ড পেমেন্টের মোট সংখ্যা',
    'total_cheques' => 'এই রেজিস্টারে ব্যবহৃত চেকের মোট সংখ্যা',

    'capability_profile' => "প্রিন্টার বিক্রেতাদের এবং মডেলের মধ্যে কমান্ড এবং কোড পৃষ্ঠাগুলির জন্য সমর্থন পরিবর্তিত হয়। যদি আপনি নিশ্চিত না হন, তাহলে 'সহজ' ক্ষমতা প্রোফাইল ব্যবহার করা ভাল

    'buy_different_currency' => 'আপনি যদি আপনার ব্যবসায়িক মুদ্রার চেয়ে ভিন্ন মুদ্রায় কেনেন তাহলে এই বিকল্পটি নির্বাচন করুন',

    'currency_exchange_factor' => '১ টি ক্রয় মুদ্রা =? বেস কারেন্সি <br> <small class = 'text-muted'> আপনি ব্যবসায়িক সেটিংস থেকে অন্য মুদ্রায় ক্রয় সক্ষম/অক্ষম করতে পারেন। </small>",

    'accounting_method' => 'অ্যাকাউন্টিং পদ্ধতি',

    'transaction_edit_days' => 'লেনদেনের তারিখ থেকে দিনের লেনদেন সম্পাদনা করা যাবে।',
    'stock_expiry_alert' => "স্টকগুলির মেয়াদ শেষ হয়ে যাচ্ছে: দিন দিন <br> <small class = 'text-muted'> আপনি ব্যবসায়িক সেটিংসে দিনের সংখ্যা নির্ধারণ করতে পারেন </small>",
    'sub_sku' => "স্কু alচ্ছিক। <br> <br> <small> স্বয়ংক্রিয়ভাবে স্কু উৎপন্ন করার জন্য এটি ফাঁকা রাখুন।
    'shipping' => 'শিপিংয়ের বিবরণ এবং শিপিং চার্জ সেট করুন। শিপিংয়ের বিবরণ এবং চার্জ যোগ/আপডেট করতে নিচের সম্পাদনা আইকনে ক্লিক করুন।"
];
