<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

   
    'accepted' => 'The: বৈশিষ্ট্যটি অবশ্যই গ্রহণ করতে হবে।',
    'active_url' => 'The: বৈশিষ্ট্যটি একটি বৈধ URL নয়।',
    'after' => 'The: অ্যাট্রিবিউট অবশ্যই তারিখের পর তারিখ হতে হবে।',
    'after_or_equal' => 'The: অ্যাট্রিবিউট অবশ্যই তারিখের পরে বা তার সমান হতে হবে।',
    'alpha' => 'The: বৈশিষ্ট্যে কেবল অক্ষর থাকতে পারে।',
    'alpha_dash' => 'The: বৈশিষ্ট্যে কেবল অক্ষর, সংখ্যা, ড্যাশ এবং আন্ডারস্কোর থাকতে পারে।',
    'alpha_num' => 'The: বৈশিষ্ট্যে কেবল অক্ষর এবং সংখ্যা থাকতে পারে।',
    'array' => 'The: অ্যাট্রিবিউট অবশ্যই একটি অ্যারে হতে হবে।',
    'before' => 'The: অ্যাট্রিবিউট অবশ্যই তারিখের আগে: তারিখ।',
    'before_or_equal' => 'The: অ্যাট্রিবিউট অবশ্যই তারিখের আগে বা তার সমান হতে হবে।',
    'between' => [
        'numeric' => 'The: বৈশিষ্ট্যটি অবশ্যই: min এবং: max এর মধ্যে হতে হবে।',
        'file' => 'The: বৈশিষ্ট্যটি অবশ্যই: min এবং: সর্বোচ্চ কিলোবাইটের মধ্যে হতে হবে।',
        'string' => 'The: বৈশিষ্ট্যটি অবশ্যই: min এবং: সর্বোচ্চ অক্ষরের মধ্যে হতে হবে।',
        'array' => 'The: বৈশিষ্ট্যটি অবশ্যই: min এবং: সর্বোচ্চ আইটেমের মধ্যে থাকতে হবে।',
    ],
    'boolean' => 'The: বৈশিষ্ট্য ক্ষেত্র সত্য বা মিথ্যা হতে হবে।',
    'confirmed' => 'The: বৈশিষ্ট্য নিশ্চিতকরণ মেলে না।',
    'date' => 'The: বৈশিষ্ট্যটি একটি বৈধ তারিখ নয়।',
    'date_equals' => 'The: বৈশিষ্ট্যটি অবশ্যই তারিখের সমান একটি তারিখ হতে হবে।',
    'date_format' => 'The: বৈশিষ্ট্যটি বিন্যাস: বিন্যাসের সাথে মেলে না।',
    'different' => 'The: attribute এবং: other অবশ্যই ভিন্ন হতে হবে।',
    'digits' => 'The: বৈশিষ্ট্যটি অবশ্যই: অঙ্ক সংখ্যা।',
    'digits_between' => 'The: বৈশিষ্ট্যটি অবশ্যই: min এবং: max digit এর মধ্যে হতে হবে।',
    'dimensions' => 'The: বৈশিষ্ট্যের অবৈধ চিত্র মাত্রা আছে।',
    'distinct' => 'The: বৈশিষ্ট্যের ক্ষেত্রের একটি সদৃশ মান আছে।',
    'email' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি বৈধ ইমেল ঠিকানা হতে হবে।',
    'end_with' => 'The: বৈশিষ্ট্যটি অবশ্যই নিম্নলিখিতগুলির মধ্যে একটি দিয়ে শেষ করতে হবে: মান',
    'exists' => 'নির্বাচিত: বৈশিষ্ট্যটি অবৈধ।',
    'file' => 'The: অ্যাট্রিবিউট অবশ্যই একটি ফাইল হতে হবে।',
    'filled' => 'The: বৈশিষ্ট্য ক্ষেত্রের একটি মান থাকতে হবে।',
    'gt' => [
        'numeric' => 'গুণ: গুণমানের চেয়ে বড় হতে হবে।',
        'file' => 'The: গুণটি ক্যালোবাইটের চেয়ে বড় হতে হবে।',
        'string' => 'The: অ্যাট্রিবিউট অবশ্যই মান অক্ষরের চেয়ে বড় হতে হবে।',
        'array' => 'The: বৈশিষ্ট্যের মধ্যে অবশ্যই: value আইটেমের চেয়ে বেশি থাকতে হবে।',
    ],
    'gte' => [
        'numeric' => 'The: গুণটি এর চেয়ে বড় বা সমান হতে হবে: মান।',
        'file' => 'The: গুণটি কিলোবাইটের চেয়ে বড় বা সমান হতে হবে।',
        'string'=>'The:অ্যাট্রিবিউট অবশ্যই বড় বা সমান: মান অক্ষরের হতে হবে।',
        'array' => 'The: বৈশিষ্ট্যটি অবশ্যই থাকতে হবে: মান আইটেম বা আরো।',
    ],
    'image' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি চিত্র হতে হবে।',
    'in' => 'নির্বাচিত: বৈশিষ্ট্যটি অবৈধ।',
    'in_array' => 'The: অ্যাট্রিবিউট ক্ষেত্রটি অন্যে নেই।',
    'integer' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি পূর্ণসংখ্যা হতে হবে।',
    'ip' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি বৈধ IP ঠিকানা হতে হবে।',
    'ipv4' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি বৈধ IPv4 ঠিকানা হতে হবে।',
    'ipv6' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি বৈধ IPv6 ঠিকানা হতে হবে।',
    'json' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি বৈধ JSON স্ট্রিং হতে হবে।',
    'lt' => [
        'numeric' => 'The: বৈশিষ্ট্যটি অবশ্যই মান থেকে কম হতে হবে।',
        'file' => 'The: গুণটি কিলোবাইটের চেয়ে কম হতে হবে।',
        'string' => 'The: অ্যাট্রিবিউট অবশ্যই মান অক্ষরের চেয়ে কম হতে হবে।',
        'array' => 'The: বৈশিষ্ট্যটি অবশ্যই এর চেয়ে কম হওয়া উচিত: মান আইটেম।',
    ],
    'lte' => [
        'numeric' => 'The: বৈশিষ্ট্যটি কম বা সমান: মান হতে হবে।',
        'file' => 'The: বৈশিষ্ট্যটি কম বা সমান হতে হবে: মান কিলোবাইট।',
        'string' => 'The: গুণটি অক্ষরের চেয়ে কম বা সমান হতে হবে।',
        'array' => 'The: বৈশিষ্ট্যটি এর চেয়ে বেশি হওয়া উচিত নয়: মান আইটেম।',
    ],
    'max' => [
        'numeric' => 'The: বৈশিষ্ট্যটি সর্বোচ্চ হতে পারে না:',
        'file' => 'The: বৈশিষ্ট্যটি সর্বোচ্চ কিলোবাইটের চেয়ে বড় নাও হতে পারে।',
        'string' => 'The: অ্যাট্রিবিউটটি সর্বোচ্চ অক্ষরের চেয়ে বড় নাও হতে পারে।',
        'array' => 'The: অ্যাট্রিবিউট এর বেশি হতে পারে না: সর্বোচ্চ আইটেম।',
    ],
    'mimes' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি ফাইল হতে হবে:: মান।',
    'mimetypes' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি ফাইল হতে হবে:: মান।',
    'min' => [
        'numeric' => 'The: গুণটি কমপক্ষে হতে হবে: মিনিট।',
        'file' => 'The: বৈশিষ্ট্যটি কমপক্ষে: কমপক্ষে কিলোবাইট হতে হবে।',
        'string' => 'The: অ্যাট্রিবিউট কমপক্ষে: min অক্ষর হতে হবে।',
        'array' => 'The: অ্যাট্রিবিউটটিতে অন্তত: মিনিট আইটেম থাকতে হবে।',
    ],
    'not_in' => 'নির্বাচিত: বৈশিষ্ট্যটি অবৈধ।',
    'not_regex' => 'The: বৈশিষ্ট্যের বিন্যাস অবৈধ।',
    'numeric' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি সংখ্যা হতে হবে।',
    'present' => 'The: বৈশিষ্ট্যের ক্ষেত্র অবশ্যই উপস্থিত থাকতে হবে।',
    'regex' => 'The: বৈশিষ্ট্য বিন্যাস অবৈধ।',
    'required' => 'The: বৈশিষ্ট্য ক্ষেত্র প্রয়োজন।',
    'required_if' => 'The: বৈশিষ্ট্যের ক্ষেত্রটি প্রয়োজন হয় যখন: অন্যটি: মান।',
    'required_unless' => 'The: বৈশিষ্ট্যের ক্ষেত্রটি প্রয়োজন হয় যদি না: অন্যটি মানগুলিতে থাকে।',
    'required_with' => 'The: মান উপস্থিত থাকে তখন: বৈশিষ্ট্য বৈশিষ্ট্য ক্ষেত্রের প্রয়োজন হয়।',
    'required_with_all' => 'The: মান উপস্থিত থাকে তখন: বৈশিষ্ট্যের ক্ষেত্রটি প্রয়োজন হয়।',
    'required_without' => 'The :গুণমান ক্ষেত্র প্রয়োজন হয় যখন: মান উপস্থিত নেই।',
    'required_without_all' => ': মানগুলি উপস্থিত নেই তখন: বৈশিষ্ট্য বৈশিষ্ট্য ক্ষেত্রের প্রয়োজন। ',
    'same' => 'The: attribute এবং: other must match।',
    'size' => [
        'numeric' => 'The: বৈশিষ্ট্যটি অবশ্যই: আকার।',
        'file' => 'The: বৈশিষ্ট্যটি অবশ্যই হতে হবে: আকার কিলোবাইট।',
        'string' => 'The: অ্যাট্রিবিউট হতে হবে: সাইজ ক্যারেক্টার।',
        'array' => 'The: বৈশিষ্ট্যে অবশ্যই: size আইটেম থাকতে হবে।',
    ],
    'Start_with' => 'The: বৈশিষ্ট্যটি অবশ্যই নিম্নলিখিতগুলির মধ্যে একটি দিয়ে শুরু করতে হবে: মান',
    'string' => 'The: অ্যাট্রিবিউট অবশ্যই একটি স্ট্রিং হতে হবে।',
    'timezone' => 'The: অ্যাট্রিবিউট অবশ্যই একটি বৈধ জোন হতে হবে।',
    'unique' => 'The: অ্যাট্রিবিউট ইতিমধ্যেই নেওয়া হয়েছে।',
    'uploaded' => 'The: বৈশিষ্ট্যটি আপলোড করতে ব্যর্থ হয়েছে।',
    'url' => 'The: বৈশিষ্ট্য বিন্যাস অবৈধ।',
    'uuid' => 'The: বৈশিষ্ট্যটি অবশ্যই একটি বৈধ UUID হতে হবে।',

    /*
    | ------------------------------------------------- -------------------------
    | কাস্টম ভ্যালিডেশন ল্যাঙ্গুয়েজ লাইনস
    | ------------------------------------------------- -------------------------
    |
    | এখানে আপনি বৈশিষ্ট্যগুলি ব্যবহার করে কাস্টম বৈধতা বার্তাগুলি নির্দিষ্ট করতে পারেন
    | লাইনগুলির নাম দেওয়ার জন্য কনভেনশন "attribute.rule"। এটি এটিকে দ্রুত করে তোলে
    | একটি নির্দিষ্ট বৈশিষ্ট্য নিয়ম জন্য একটি নির্দিষ্ট কাস্টম ভাষা লাইন নির্দিষ্ট করুন।
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'কাস্টম-বার্তা',
        ],
    ],

    /*
    | ------------------------------------------------- -------------------------
    | কাস্টম বৈধতা বৈশিষ্ট্য
    | ------------------------------------------------- -------------------------
    |
    | আমাদের বৈশিষ্ট্য স্থানধারককে অদলবদল করার জন্য নিম্নলিখিত ভাষা লাইনগুলি ব্যবহার করা হয়
    | এর পরিবর্তে আরো কিছু পাঠক বান্ধব যেমন "ই-মেইল ঠিকানা"
    | "ইমেইল" এর। এটি কেবল আমাদের বার্তাকে আরও প্রকাশযোগ্য করতে সাহায্য করে।
    |
    */

    'attributes' => [],
    'custom-messages' => [
        'quantity_not_available' => 'শুধুমাত্র: পরিমাণ: একক উপলব্ধ',
        'this_field_is_required' => 'এই ক্ষেত্রটি প্রয়োজন'
    ],

];